[
  {
    "title": "Music Near Me",
    "body": "Boy I really wish I had some place where I could hear live music near my house. Like, I'm really into this weirdcore yodeling techno metal and I wish I could meet up with people who are also into my same kind of jams. You just can't find anyone who appreciates the classics anymore, am I right?",
    "user_id": 2
  },
  {
    "title": "Recipe for Rice Cooker Rice",
    "body": "VEGETABLE FRIED RICE RECIPE\n Published: Nov 13, 2016 · Modified: Sep 19, 2022 by Colleen 12 Comments\n Sharing is caring!\n Vegetable Fried Rice is such a simple, but versatile dish. I love making it at home because I get to control the amount of fat and other ingredients, plus I can load it up with all kinds of vegetables. Most of all, fried rice is a perfect way to turn last night's leftovers into a brand new, delicious dinner.\nVegetable Fried Rice\nWHY USE LEFTOVERS?\nThe best thing about leftover rice is fried rice. Don't discard that leftover rice! Leftover rice makes the best fried rice. Because, as the cooked rice sits in the fridge, it dries out a little. Then the grains become nicely separated. Which sets the perfect stage for making a delicious, fried rice dish.\nI like to make extra rice when I cook these yummy Cajun Red Beans & Rice, so there is some left for fried rice. Even If you don't have leftover rice, it's worthwhile to cook some rice ahead of time, let it cool, and then sit in the fridge for a least a few hours, if not overnight. And, to be honest, if you try making this with freshly cooked rice, you will end up with a sticky, mushy mess. I don't recommend it.\nAny cooked rice, brown or white, will work for making this dish. My favourite is basmati, but jasmine or just plain long grain works just as well.\nVegetable Fried Rice\nUSE WHATEVER'S IN THE FRIDGE FOR FRIED RICE\nVegetable fried rice is a pretty simple dish. But you have to plan ahead just a little here. The flavours of ginger and garlic, plus soy and sesame, really make this dish shine. And adding tofu makes it a complete meal. If you aren't vegetarian, you can sub the tofu for chicken, or any leftover meat that you have. The best fried rice is when you have to make do with what you have in the fridge.\nYou can use all kinds of veggies, fresh or frozen, and in fact, frozen peas are what I'm using here. Mixed frozen peas and carrots work really well, too. If you have leftover cooked veggies, all the better for a true leftover masterpiece. Just about any vegetable will work, except maybe potatoes. But, try sweet potato cubes, cauliflower, zucchini, carrots, or mushrooms.\nYou can also crack an egg and scramble it up into your rice, as I often do, for extra protein, texture, and flavour. Sometimes I even like to add some chopped peanuts or cashews if I have them.\nCOOKWARE & PREP\nA wok is ideal for making fried rice, but any large skillet will work, too. I have found that non-stick skillets still need some oil to give the rice the right fried texture. Peanut oil is ideal here for its low smoking point. Have all of your ingredients ready and close at hand when you begin.\nSERVING SUGGESTIONS\nServe fried rice by itself, or as a side dish for General Tso Shrimp, Air Fryer Orange Chicken, Baked Sweet & Sour Meatballs or with a stir fry like Steak & Asparagus Stir Fry"
  },
  {
    "title": "Music Near Me",
    "body": "Boy I really wish I had some place where I could hear live music near my house. Like, I'm really into this weirdcore yodeling techno metal and I wish I could meet up with people who are also into my same kind of jams. You just can't find anyone who appreciates the classics anymore, am I right?",
    "user_id": 1
  },

  {
    "title": "I love cats.",
    "body": "I love every kind of cat. I just want to hug all of them. Sorry, I''m crying right now because I just want to hug them all. But you can''t hug every cat. But anyway, I am a cat lover, and I love to run... sorry I''m thinking about cats again! I just really love cats!",
    "user_id": 3
  }
]
